zephyrproject-rtos/trusted-firmware-m/platform/ext/target/nordic_nrf/common/core/startup_nrf54lm.c
/*
 * Copyright (c) 2022 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*
 * This file is derivative of CMSIS V5.9.0 startup_ARMCM33.c
 * Git SHA: 2b7495b8535bdcb306dac29b9ded4cfb679d7e5c
 */

/*
 * Define __VECTOR_TABLE_ATTRIBUTE (which can be provided by cmsis.h)
 * before including cmsis.h because TF-M's linker script
 * tfm_common_s.ld assumes the vector table section is called .vectors
 * while cmsis.h will sometimes (e.g. when cmsis is provided by nrfx)
 * default to using the name .isr_vector.
 */
#define __VECTOR_TABLE_ATTRIBUTE  __attribute__((used, section(".vectors")))

#include "cmsis.h"
#include "startup.h"
#include "exception_info.h"

/* Declarations for common nRF54L interrupt handlers (built separately) */
#include "startup_nrf54l_common.h"

/* NRF54LM20A-specific interrupt handlers */
DEFAULT_IRQ_HANDLER(EGU00_IRQHandler)
DEFAULT_IRQ_HANDLER(USBHS_IRQHandler)
DEFAULT_IRQ_HANDLER(PDM20_IRQHandler)
DEFAULT_IRQ_HANDLER(PDM21_IRQHandler)
DEFAULT_IRQ_HANDLER(TDM_IRQHandler)
DEFAULT_IRQ_HANDLER(SERIAL23_IRQHandler)
DEFAULT_IRQ_HANDLER(SERIAL24_IRQHandler)
DEFAULT_IRQ_HANDLER(VREGUSB_IRQHandler)

#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#endif

const VECTOR_TABLE_Type __VECTOR_TABLE[] __VECTOR_TABLE_ATTRIBUTE = {
    (VECTOR_TABLE_Type)(&__INITIAL_SP), /*      Initial Stack Pointer */
                                        /* Exceptions */
    Reset_Handler,
    NMI_Handler,
    HardFault_Handler,
    MemManage_Handler, /* MPU Fault Handler */
    BusFault_Handler,
    UsageFault_Handler,
    SecureFault_Handler,
    default_tfm_IRQHandler, /* SecureFault_IRQn */
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SVC_Handler,
    DebugMon_Handler,
    default_tfm_IRQHandler,
    PendSV_Handler,
    SysTick_Handler,
    /* Device specific interrupt handlers */
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SWI00_IRQHandler,
    SWI01_IRQHandler,
    SWI02_IRQHandler,
    SWI03_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SPU00_IRQHandler,
    MPC00_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    AAR00_CCM00_IRQHandler,
    ECB00_IRQHandler,
    VPR00_IRQHandler,
    default_tfm_IRQHandler,
    RRAMC_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    CTRLAP_IRQHandler,
    default_tfm_IRQHandler,
    CM33SS_IRQHandler,
    TIMER00_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    CRACEN_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SPU10_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    TIMER10_IRQHandler,
    EGU10_IRQHandler,
    EGU10_IRQHandler,
    EGU10_IRQHandler,
    default_tfm_IRQHandler,
    RADIO_0_IRQHandler,
    RADIO_1_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SPU20_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SERIAL20_IRQHandler,
    SERIAL21_IRQHandler,
    default_tfm_IRQHandler,
    EGU20_IRQHandler,
    TIMER20_IRQHandler,
    TIMER21_IRQHandler,
    TIMER22_IRQHandler,
    TIMER23_IRQHandler,
    TIMER24_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SAADC_IRQHandler,
    default_tfm_IRQHandler,
    TEMP_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    GPIOTE20_1_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    QDEC20_IRQHandler,
    QDEC21_IRQHandler,
    GRTC_0_IRQHandler,
    GRTC_1_IRQHandler,
    GRTC_2_IRQHandler,
    GRTC_3_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    TDM_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SERIAL23_IRQHandler,
    SERIAL24_IRQHandler,
    TAMPC_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SPU30_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    SERIAL30_IRQHandler,
    default_tfm_IRQHandler,
    COMP_LPCOMP_IRQHandler,
    default_tfm_IRQHandler,
    WDT30_IRQHandler,
    WDT31_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    GPIOTE30_1_IRQHandler,
    CLOCK_POWER_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    default_tfm_IRQHandler,
    VREGUSB_IRQHandler,
};

#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif
